import win32api
import win32con
import time


def click(postion):
    win32api.SetCursorPos(postion)
    time.sleep(1)
    win32api.mouse_event(win32con.MOUSEEVENTF_LEFTUP | win32con.MOUSEEVENTF_LEFTDOWN, 0, 0, 0, 0)


time.sleep(3)

# 设置鼠标移动到的位置
# 行表示一个视频从列表选择到播放完毕所有要点击的位置
# 不同的列表示不同的视频，循环任务；
d = 50
pos = [
    (855, 418), (887, 667), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+d), (887, 639), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+2*d), (887, 725), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+3*d), (887, 690), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+4*d), (887, 690), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+5*d), (887, 667), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+6*d), (887, 667), (77, 432), (1028, 18), (471, 19), (117, 17),
    (855, 418+7*d), (887, 667), (111, 580), (1028, 18), (471, 19), (117, 17),
    (855, 418+8*d), (887, 667), (111, 580), (1028, 18), (471, 19), (117, 17),
    (855, 418+9*d), (887, 667), (77, 432), (1028, 18), (471, 19), (117, 17),
]

for i in range(len(pos)):
    if (i % 6) <= 1:  # 0,1：前两步，移动到视频列表（默认视频列表网页已经打开），然后单击对应的视频项；
        click(pos[i])
        time.sleep(3)
    elif (i % 6) == 2:  # 2：第三步，由于可能会有网络卡顿，需要有间隔地双击播放器暂停和播放键；
        n = 0
        while True:
            n += 1
            click(pos[i])
            click(pos[i])
            time.sleep(10)

            if n > 2:  # 60*60/10:
                break
    elif (i % 6) == 3:  # 3：第四步，关闭视频播放网页；
        click(pos[i])
        time.sleep(1)
    elif (i % 6) == 4:  # 4：第五步，关闭视频介绍网页；
        click(pos[i])
        time.sleep(1)
    elif (i % 6) == 5:  # 5：第六步，打开视频列表页；
        click(pos[i])
        time.sleep(1)
